/*Завдання 2. Написати функцію, яка отримує покажчик на
динамічний масив і його розмір. Функція має видалити з
масиву всі прості числа та повернути покажчик на новий
динамічний масив.*/
#include <iostream>
using namespace std;

void inputArr(int*& arr, int& size) {       //Функція ініціалізації динамічного масиву;
    for (int i = 0; i < size; i++)
    {
        cout << "Enter [" << i + 1 << "] element of massive = ";
        cin >> arr[i];
    }
}
void printArr(int* arr, int size) {        // Функція друку динамічного масиву
    for (int i = 0; i < size; i++)
    {
        cout << "Arr [" << i + 1 << "] = " << arr[i] << endl;
    }
}
bool simpleNum(int n)       //Функція визначення простого числа
{
    for (int i = 2; i <= n / 2; i++) {  //запускаємо цикл для визначення простих чисел
        if (n % i == 0) {            //перевірка чи наше число ділиться на інші числа
            return false;           //якщо ділиться - повертаємо не правду(число не просте )
        }
    }
    return true;    //якщо ділення не відбулось = число просте 
}
void delSimpleNum(int*& arr, int& size) { //Функція видалення просто числа з масиву
    int k = 0;      //змінна для визначення правди/неправди
    int size1 = size;
    int* arr1 = new int[size1];     //наш новий масив 
    int c = 0;    //для майбутнього нового розміру масива
    for (int i = 0; i < size; i++)  //цикл для перерахунку усіх елементів масиву
    {
        k = 0;  //для обнулення
        k = simpleNum(arr[i]);  //визначаємо чи даний елемент масиву - простий
        if (k == 0) {      //якщо на даному етапі елемент не простий - записуємо у новий масив 
            arr1[c] = arr[i];
            c++;

        }
    }
    arr = arr1;
    size = c;

}
int main()
{
    int size = 100;
    cout << "Enter size=";
    cin >> size;
    int* arr = new int[size];       //розподіл динамічної пам’яті;

    inputArr(arr, size);    //Викликаємо ф-цію ініціалізації динамічного масиву
    printArr(arr, size);    //Викликаємо ф-цію друку динамічного масиву;
    cout << endl;
    delSimpleNum(arr, size);    //Викликаємо ф-цію для видалення простих елементів у масиві
    printArr(arr, size);        //друкуємо наш новий масив.
}


